Revit 2027 API
ForgeTypeId(String) Constructor
 Constructs a ForgeTypeId holding the given schema identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ForgeTypeId(
	string typeId
)
Public Sub New (
	typeId As String
)
public:
ForgeTypeId(
	String^ typeId
)
new :
        typeId : string -> ForgeTypeId
Parameters
typeId String
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ForgeTypeId Class
ForgeTypeId Overload
Autodesk.Revit.DB Namespace